iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2CONFIG;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3CONFIG;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4CONFIG;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5CONFIG;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6CONFIG;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7SRCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DESTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7DESTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t R:1;
      uint64_t LLI:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7LLI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSFERSIZE:12;
      uint64_t SBSIZE:3;
      uint64_t DBSIZE:3;
      uint64_t SWIDTH:3;
      uint64_t DWIDTH:3;
      uint64_t S:1;
      uint64_t D:1;
      uint64_t SI:1;
      uint64_t DI:1;
      uint64_t PROT1:1;
      uint64_t PROT2:1;
      uint64_t PROT3:1;
      uint64_t I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t SRCPERIPHERAL:5;
      uint64_t DESTPERIPHERAL:5;
      uint64_t FLOWCNTRL:3;
      uint64_t IE:1;
      uint64_t ITC:1;
      uint64_t L:1;
      uint64_t A:1;
      uint64_t H:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7CONFIG;

