iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
};

#define GPDMA (*(volatile struct GPDMA_tag *) 0x40002000)

struct SPIFI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEOUT:16;
      uint64_t CSHIGH:4;
      uint64_t RESERVED_0:1;
      uint64_t D_PRFTCH_DIS:1;
      uint64_t INTEN:1;
      uint64_t MODE3:1;
      uint64_t RESERVED_1:3;
      uint64_t PRFTCH_DIS:1;
      uint64_t DUAL:1;
      uint64_t RFCLK:1;
      uint64_t FBCLK:1;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALEN:14;
      uint64_t POLL:1;
      uint64_t DOUT:1;
      uint64_t INTLEN:3;
      uint64_t FIELDFORM:2;
      uint64_t FRAMEFORM:3;
      uint64_t OPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLIMIT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLIMIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:14;
      uint64_t POLL:1;
      uint64_t DOUT:1;
      uint64_t INTLEN:3;
      uint64_t FIELDFORM:2;
      uint64_t FRAMEFORM:3;
      uint64_t OPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCINIT:1;
      uint64_t CMD:1;
      uint64_t reservedSpace0:2;
      uint64_t RESET:1;
      uint64_t INTRQ:1;
      uint64_t RESERVED:18;
      uint64_t VERSION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define SPIFI (*(volatile struct SPIFI_tag *) 0x40003000)

struct SDMMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTROLLER_RESET:1;
      uint64_t FIFO_RESET:1;
      uint64_t DMA_RESET:1;
      uint64_t RESERVED_0:1;
      uint64_t INT_ENABLE:1;
      uint64_t RESERVED_1:1;
      uint64_t READ_WAIT:1;
      uint64_t SEND_IRQ_RESPONSE:1;
      uint64_t ABORT_READ_DATA:1;
      uint64_t SEND_CCSD:1;
      uint64_t SEND_AUTO_STOP:1;
      uint64_t CEATA_DEVICE_INTERRUPT_STATUS:1;
      uint64_t RESERVED_2:4;
      uint64_t CARD_VOLTAGE_A0:1;
      uint64_t CARD_VOLTAGE_A1:1;
      uint64_t CARD_VOLTAGE_A2:1;
      uint64_t RESERVED_3:5;
      uint64_t RESERVED_4:1;
      uint64_t USE_INTERNAL_DMAC:1;
      uint64_t RESERVED_5:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER_ENABLE:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWREN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DIVIDER0:8;
      uint64_t CLK_DIVIDER1:8;
      uint64_t CLK_DIVIDER2:8;
      uint64_t CLK_DIVIDER3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SOURCE:2;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCLK_ENABLE:1;
      uint64_t RESERVED_0:15;
      uint64_t CCLK_LOW_POWER:1;
      uint64_t RESERVED_1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE_TIMEOUT:8;
      uint64_t DATA_TIMEOUT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARD_WIDTH0:1;
      uint64_t RESERVED_0:15;
      uint64_t CARD_WIDTH1:1;
      uint64_t RESERVED_1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_SIZE:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLKSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYTE_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BYTCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDET:1;
      uint64_t RE:1;
      uint64_t CDONE:1;
      uint64_t DTO:1;
      uint64_t TXDR:1;
      uint64_t RXDR:1;
      uint64_t RCRC:1;
      uint64_t DCRC:1;
      uint64_t RTO:1;
      uint64_t DRTO:1;
      uint64_t HTO:1;
      uint64_t FRUN:1;
      uint64_t HLE:1;
      uint64_t SBE:1;
      uint64_t ACD:1;
      uint64_t EBE:1;
      uint64_t SDIO_INT_MASK:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD_ARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDARG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD_INDEX:6;
      uint64_t RESPONSE_EXPECT:1;
      uint64_t RESPONSE_LENGTH:1;
      uint64_t CHECK_RESPONSE_CRC:1;
      uint64_t DATA_EXPECTED:1;
      uint64_t READ_WRITE:1;
      uint64_t TRANSFER_MODE:1;
      uint64_t SEND_AUTO_STOP:1;
      uint64_t WAIT_PRVDATA_COMPLETE:1;
      uint64_t STOP_ABORT_CMD:1;
      uint64_t SEND_INITIALIZATION:1;
      uint64_t RESERVED_0:5;
      uint64_t UPDATE_CLOCK_REGISTERS_ONLY:1;
      uint64_t READ_CEATA_DEVICE:1;
      uint64_t CCS_EXPECTED:1;
      uint64_t ENABLE_BOOT:1;
      uint64_t EXPECT_BOOT_ACK:1;
      uint64_t DISABLE_BOOT:1;
      uint64_t BOOT_MODE:1;
      uint64_t VOLT_SWITCH:1;
      uint64_t RESERVED_1:2;
      uint64_t START_CMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDET:1;
      uint64_t RE:1;
      uint64_t CDONE:1;
      uint64_t DTO:1;
      uint64_t TXDR:1;
      uint64_t RXDR:1;
      uint64_t RCRC:1;
      uint64_t DCRC:1;
      uint64_t RTO:1;
      uint64_t DRTO:1;
      uint64_t HTO:1;
      uint64_t FRUN:1;
      uint64_t HLE:1;
      uint64_t SBE:1;
      uint64_t ACD:1;
      uint64_t EBE:1;
      uint64_t SDIO_INTERRUPT:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDET:1;
      uint64_t RE:1;
      uint64_t CDONE:1;
      uint64_t DTO:1;
      uint64_t TXDR:1;
      uint64_t RXDR:1;
      uint64_t RCRC:1;
      uint64_t DCRC:1;
      uint64_t RTO_BAR:1;
      uint64_t DRTO_BDS:1;
      uint64_t HTO:1;
      uint64_t FRUN:1;
      uint64_t HLE:1;
      uint64_t SBE:1;
      uint64_t ACD:1;
      uint64_t EBE:1;
      uint64_t SDIO_INTERRUPT:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFO_RX_WATERMARK:1;
      uint64_t FIFO_TX_WATERMARK:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t FIFO_FULL:1;
      uint64_t CMDFSMSTATES:4;
      uint64_t DATA_3_STATUS:1;
      uint64_t DATA_BUSY:1;
      uint64_t DATA_STATE_MC_BUSY:1;
      uint64_t RESPONSE_INDEX:6;
      uint64_t FIFO_COUNT:13;
      uint64_t DMA_ACK:1;
      uint64_t DMA_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_WMARK:12;
      uint64_t RESERVED_0:4;
      uint64_t RX_WMARK:12;
      uint64_t DMA_MTS:3;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARD_DETECT:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDETECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE_PROTECT:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRTPRT;

