iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANS_CARD_BYTE_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCBCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANS_FIFO_BYTE_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBBCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEBOUNCE_COUNT:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBNCE;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARD_RESET:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RST_N;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t FB:1;
      uint64_t DSL:5;
      uint64_t DE:1;
      uint64_t PBL:3;
      uint64_t RESERVED:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLDMND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t RI:1;
      uint64_t FBE:1;
      uint64_t RESERVED_0:1;
      uint64_t DU:1;
      uint64_t CES:1;
      uint64_t RESERVED_1:2;
      uint64_t NIS:1;
      uint64_t AIS:1;
      uint64_t EB:3;
      uint64_t FSM:4;
      uint64_t RESERVED_2:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t RI:1;
      uint64_t FBE:1;
      uint64_t RESERVED_0:1;
      uint64_t DU:1;
      uint64_t CES:1;
      uint64_t RESERVED_1:2;
      uint64_t NIS:1;
      uint64_t AIS:1;
      uint64_t RESERVED_2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUFADDR;

};

#define SDMMC (*(volatile struct SDMMC_tag *) 0x40004000)

struct EMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t M:1;
      uint64_t L:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:1;
      uint64_t S:1;
      uint64_t SA:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t RESERVED_0:7;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CE:1;
      uint64_t CS:1;
      uint64_t SR:1;
      uint64_t RESERVED_0:2;
      uint64_t MMC:1;
      uint64_t RESERVED_1:1;
      uint64_t I:2;
      uint64_t RESERVED_2:5;
      uint64_t RESERVED_3:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFRESH:11;
      uint64_t RESERVED:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICREFRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICREADCONFIG;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRAS:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRAS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSREX:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICSREX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPR:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDAL:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICDAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWR:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRC:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRFC:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXSR:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICXSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRRD:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRD:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICMRD;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTENDEDWAIT:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICEXTENDEDWAIT;

  uint8_t res3[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MD:2;
      uint64_t RESERVED_1:2;
      uint64_t AM0:6;
      uint64_t RESERVED_2:1;
      uint64_t AM1:1;
      uint64_t RESERVED_3:4;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t RESERVED_0:6;
      uint64_t CAS:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS0;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t MD:2;
      uint64_t RESERVED_1:2;
      uint64_t AM0:6;
      uint64_t RESERVED_2:1;
      uint64_t AM1:1;
      uint64_t RESERVED_3:4;
      uint64_t B:1;
      uint64_t P:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t RESERVED_0:6;
      uint64_t CAS:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS1;

