iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_255;

  uint8_t res1[512];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_90;

