iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CrsrOn:1;
      uint64_t RESERVED_0:3;
      uint64_t CRSRNUM1_0:2;
      uint64_t RESERVED_1:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CrsrSize:1;
      uint64_t FRAMESYNC:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RED:8;
      uint64_t GREEN:8;
      uint64_t BLUE:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_PAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RED:8;
      uint64_t GREEN:8;
      uint64_t BLUE:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_PAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRX:10;
      uint64_t RESERVED_0:6;
      uint64_t CRSRY:10;
      uint64_t RESERVED_1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_XY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRCLIPX:6;
      uint64_t RESERVED_0:2;
      uint64_t CRSRCLIPY:6;
      uint64_t RESERVED_1:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CLIP;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRIM:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRIC:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRRIS:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRMIS:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTSTAT;

};

#define LCD (*(volatile struct LCD_tag *) 0x40008000)

struct EEPROM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPHASE2:8;
      uint64_t RPHASE1:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RWSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOPROG:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOPROG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHASE3:8;
      uint64_t PHASE2:8;
      uint64_t PHASE1:8;
      uint64_t RESERVED:7;
      uint64_t LCK_PARWEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRDWN:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRDWN;

  uint8_t res1[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_CLR_EN:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_SET_EN:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t END_OF_PROG:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t EE_PROG_DONE:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_CLR_ST:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t PROG_SET_ST:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATSET;

};

#define EEPROM (*(volatile struct EEPROM_tag *) 0x4000e000)

