iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
struct ETHERNET_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t DF:1;
      uint64_t BL:2;
      uint64_t ACS:1;
      uint64_t RESERVED_1:1;
      uint64_t DR:1;
      uint64_t RESERVED_2:1;
      uint64_t DM:1;
      uint64_t LM:1;
      uint64_t DO:1;
      uint64_t FES:1;
      uint64_t PS:1;
      uint64_t DCRS:1;
      uint64_t IFG:3;
      uint64_t JE:1;
      uint64_t RESERVED_3:1;
      uint64_t JD:1;
      uint64_t WD:1;
      uint64_t RESERVED_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:1;
      uint64_t HUC:1;
      uint64_t HMC:1;
      uint64_t DAIF:1;
      uint64_t PM:1;
      uint64_t DBF:1;
      uint64_t PCF:2;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t HPF:1;
      uint64_t RESERVED_2:20;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FRAME_FILTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HASHTABLE_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HASHTABLE_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GB:1;
      uint64_t W:1;
      uint64_t CR:4;
      uint64_t GR:5;
      uint64_t PA:5;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MII_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GD:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MII_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB:1;
      uint64_t TFE:1;
      uint64_t RFE:1;
      uint64_t UP:1;
      uint64_t PLT:2;
      uint64_t RESERVED_0:1;
      uint64_t DZPQ:1;
      uint64_t RESERVED_1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FLOW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VL:16;
      uint64_t ETV:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VLAN_TAG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIDLESTAT:1;
      uint64_t FIFOSTAT0:2;
      uint64_t RESERVED_0:1;
      uint64_t RXFIFOSTAT1:1;
      uint64_t RXFIFOSTAT:2;
      uint64_t RESERVED_1:1;
      uint64_t RXFIFOLVL:2;
      uint64_t RESERVED_2:6;
      uint64_t TXIDLESTAT:1;
      uint64_t TXSTAT:2;
      uint64_t PAUSE:1;
      uint64_t TXFIFOSTAT:2;
      uint64_t TXFIFOSTAT1:1;
      uint64_t RESERVED_3:1;
      uint64_t TXFIFOLVL:1;
      uint64_t TXFIFOFULL:1;
      uint64_t RESERVED_4:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_DEBUG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RWAKE_FRFLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t MPE:1;
      uint64_t WFE:1;
      uint64_t RESERVED_0:2;
      uint64_t MPR:1;
      uint64_t WFR:1;
      uint64_t RESERVED_1:2;
      uint64_t GU:1;
      uint64_t RESERVED_2:21;
      uint64_t WFFRPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_PMT_CTRL_STAT;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t PMT:1;
      uint64_t RESERVED_1:5;
      uint64_t TS:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t PMTIM:1;
      uint64_t RESERVED_1:5;
      uint64_t TSIM:1;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A47_32:16;
      uint64_t RESERVED:15;
      uint64_t MO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR0_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR0_LOW;

  uint8_t res2[1720];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSENA:1;
      uint64_t TSCFUPDT:1;
      uint64_t TSINIT:1;
      uint64_t TSUPDT:1;
      uint64_t TSTRIG:1;
      uint64_t TSADDREG:1;
      uint64_t RESERVED:2;
      uint64_t TSENALL:1;
      uint64_t TSCTRLSSR:1;
      uint64_t TSVER2ENA:1;
      uint64_t TSIPENA:1;
      uint64_t TSIPV6ENA:1;
      uint64_t TSIPV4ENA:1;
      uint64_t TSEVNTENA:1;
      uint64_t TSMSTRENA:1;
      uint64_t TSCLKTYPE:2;
      uint64_t TSENMACADDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_TIMESTP_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSINC:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUBSECOND_INCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
      uint64_t PSNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NANOSECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECONDSUPDATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
      uint64_t ADDSUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NANOSECONDSUPDATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TARGETSECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTR:31;
      uint64_t RESERVED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TARGETNANOSECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSHWR:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIGHWORD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSOVF:1;
      uint64_t TSTARGT:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMESTAMPSTAT;

  uint8_t res3[2260];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t DA:1;
      uint64_t DSL:5;
      uint64_t ATDS:1;
      uint64_t PBL:6;
      uint64_t PR:2;
      uint64_t FB:1;
      uint64_t RPBL:6;
      uint64_t USP:1;
      uint64_t PBL8X:1;
      uint64_t AAL:1;
      uint64_t MB:1;
      uint64_t TXPR:1;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_BUS_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TRANS_POLL_DEMAND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_REC_POLL_DEMAND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_REC_DES_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TRANS_DES_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t TPS:1;
      uint64_t TU:1;
      uint64_t TJT:1;
      uint64_t OVF:1;
      uint64_t UNF:1;
      uint64_t RI:1;
      uint64_t RU:1;
      uint64_t RPS:1;
      uint64_t RWT:1;
      uint64_t ETI:1;
      uint64_t RESERVED_0:2;
      uint64_t FBI:1;
      uint64_t ERI:1;
      uint64_t AIE:1;
      uint64_t NIS:1;
      uint64_t RS:3;
      uint64_t TS:3;
      uint64_t EB1:1;
      uint64_t EB2:1;
      uint64_t EB3:1;
      uint64_t RESERVED_1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t SR:1;
      uint64_t OSF:1;
      uint64_t RTC_bitfield:2;
      uint64_t RESERVED_1:1;
      uint64_t FUF:1;
      uint64_t FEF:1;
      uint64_t RESERVED_2:5;
      uint64_t ST:1;
      uint64_t TTC:3;
      uint64_t RESERVED_3:3;
      uint64_t FTF:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:2;
      uint64_t DFF:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_OP_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TSE:1;
      uint64_t TUE:1;
      uint64_t TJE:1;
      uint64_t OVE:1;
      uint64_t UNE:1;
      uint64_t RIE:1;
      uint64_t RUE:1;
      uint64_t RSE:1;
      uint64_t RWE:1;
      uint64_t ETE:1;
      uint64_t RESERVED_0:2;
      uint64_t FBE:1;
      uint64_t ERE:1;
      uint64_t AIE:1;
      uint64_t NIE:1;
      uint64_t RESERVED_1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_INT_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMC:16;
      uint64_t OC:1;
      uint64_t FMA:11;
      uint64_t OF:1;
      uint64_t RESERVED:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_MFRM_BUFOF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIWT:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_REC_INT_WDT;

  uint8_t res4[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CURHOST_TRANS_DES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CURHOST_REC_DES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CURHOST_TRANS_BUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CURHOST_REC_BUF;

