iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
};

#define REGFILE (*(volatile struct REGFILE_tag *) 0x40041000)

struct PMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_EVENT0:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD0_SLEEP0_HW_ENA;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWR_STATE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD0_SLEEP0_MODE;

};

#define PMC (*(volatile struct PMC_tag *) 0x40042000)

struct CREG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN1KHZ:1;
      uint64_t EN32KHZ:1;
      uint64_t RESET32KHZ:1;
      uint64_t PD32KHZ:1;
      uint64_t RESERVED_0:1;
      uint64_t USB0PHY:1;
      uint64_t ALARMCTRL:2;
      uint64_t BODLVL1:2;
      uint64_t BODLVL2:2;
      uint64_t SAMPLECTRL:2;
      uint64_t WAKEUP0CTRL:2;
      uint64_t WAKEUP1CTRL:2;
      uint64_t RESERVED_1:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREG0;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t M3MAP:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M3MEMMAP;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:11;
      uint64_t M3TAPSEL:1;
      uint64_t RESERVED_1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAMUXPER0:2;
      uint64_t DMAMUXPER1:2;
      uint64_t DMAMUXPER2:2;
      uint64_t DMAMUXPER3:2;
      uint64_t DMAMUXPER4:2;
      uint64_t DMAMUXPER5:2;
      uint64_t DMAMUXPER6:2;
      uint64_t DMAMUXPER7:2;
      uint64_t DMAMUXPER8:2;
      uint64_t DMAMUXPER9:2;
      uint64_t DMAMUXPER10:2;
      uint64_t DMAMUXPER11:2;
      uint64_t DMAMUXPER12:2;
      uint64_t DMAMUXPER13:2;
      uint64_t DMAMUXPER14:2;
      uint64_t DMAMUXPER15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:12;
      uint64_t FLASHTIM:4;
      uint64_t RESERVED_1:15;
      uint64_t POW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCFGA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:12;
      uint64_t FLASHTIM:4;
      uint64_t RESERVED_1:15;
      uint64_t POW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCFGB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETB:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETHMODE:3;
      uint64_t RESERVED_0:1;
      uint64_t CTOUTCTRL:1;
      uint64_t RESERVED_1:7;
      uint64_t I2S0_TX_SCK_IN_SEL:1;
      uint64_t I2S0_RX_SCK_IN_SEL:1;
      uint64_t I2S1_TX_SCK_IN_SEL:1;
      uint64_t I2S1_RX_SCK_IN_SEL:1;
      uint64_t EMC_CLK_SEL:1;
      uint64_t RESERVED_2:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREG6;

  uint8_t res2[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIPID;

  uint8_t res3[764];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLTV:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB0FLADJ;

  uint8_t res4[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLTV:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1FLADJ;

};

#define CREG (*(volatile struct CREG_tag *) 0x40043004)

struct EVENTROUTER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_L:1;
      uint64_t WAKEUP1_L:1;
      uint64_t WAKEUP2_L:1;
      uint64_t WAKEUP3_L:1;
      uint64_t ATIMER_L:1;
      uint64_t RTC_L:1;
      uint64_t BOD_L:1;
      uint64_t WWDT_L:1;
      uint64_t ETH_L:1;
      uint64_t USB0_L:1;
      uint64_t USB1_L:1;
      uint64_t SDMMC_L:1;
      uint64_t CAN_L:1;
      uint64_t TIM2_L:1;
      uint64_t TIM6_L:1;
      uint64_t QEI_L:1;
      uint64_t TIM14_L:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_L:1;
      uint64_t BODRESET_L:1;
      uint64_t DPDRESET_L:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HILO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_E:1;
      uint64_t WAKEUP1_E:1;
      uint64_t WAKEUP2_E:1;
      uint64_t WAKEUP3_E:1;
      uint64_t ATIMER_E:1;
      uint64_t RTC_E:1;
      uint64_t BOD_E:1;
      uint64_t WWDT_E:1;
      uint64_t ETH_E:1;
      uint64_t USB0_E:1;
      uint64_t USB1_E:1;
      uint64_t SDMMC_E:1;
      uint64_t CAN_E:1;
      uint64_t TIM2_E:1;
      uint64_t TIM6_E:1;
      uint64_t QEI_E:1;
      uint64_t TIM14_E:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_E:1;
      uint64_t BODRESET_E:1;
      uint64_t DPDRESET_E:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDGE;

  uint8_t res0[4048];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_CLREN:1;
      uint64_t WAKEUP1_CLREN:1;
      uint64_t WAKEUP2_CLREN:1;
      uint64_t WAKEUP3_CLREN:1;
      uint64_t ATIMER_CLREN:1;
      uint64_t RTC_CLREN:1;
      uint64_t BOD_CLREN:1;
      uint64_t WWDT_CLREN:1;
      uint64_t ETH_CLREN:1;
      uint64_t USB0_CLREN:1;
      uint64_t USB1_CLREN:1;
      uint64_t SDMMC_CLREN:1;
      uint64_t CAN_CLREN:1;
      uint64_t TIM2_CLREN:1;
      uint64_t TIM6_CLREN:1;
      uint64_t QEI_CLREN:1;
      uint64_t TIM14_CLREN:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_CLREN:1;
      uint64_t BODRESET_CLREN:1;
      uint64_t DPDRESET_CLREN:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_SETEN:1;
      uint64_t WAKEUP1_SETEN:1;
      uint64_t WAKEUP2_SETEN:1;
      uint64_t WAKEUP3_SETEN:1;
      uint64_t ATIMER_SETEN:1;
      uint64_t RTC_SETEN:1;
      uint64_t BOD_SETEN:1;
      uint64_t WWDT_SETEN:1;
      uint64_t ETH_SETEN:1;
      uint64_t USB0_SETEN:1;
      uint64_t USB1_SETEN:1;
      uint64_t SDMMC_SETEN:1;
      uint64_t CAN_SETEN:1;
      uint64_t TIM2_SETEN:1;
      uint64_t TIM6_SETEN:1;
      uint64_t QEI_SETEN:1;
      uint64_t TIM14_SETEN:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_SETEN:1;
      uint64_t BODRESET_SETEN:1;
      uint64_t DPDRESET_SETEN:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_ST:1;
      uint64_t WAKEUP1_ST:1;
      uint64_t WAKEUP2_ST:1;
      uint64_t WAKEUP3_ST:1;
      uint64_t ATIMER_ST:1;
      uint64_t RTC_ST:1;
      uint64_t BOD_ST:1;
      uint64_t WWDT_ST:1;
      uint64_t ETH_ST:1;
      uint64_t USB0_ST:1;
      uint64_t USB1_ST:1;
      uint64_t SDMMC_ST:1;
      uint64_t CAN_ST:1;
      uint64_t TIM2_ST:1;
      uint64_t TIM6_ST:1;
      uint64_t QEI_ST:1;
      uint64_t TIM14_ST:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_ST:1;
      uint64_t BODRESET_ST:1;
      uint64_t DPDRESET_ST:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_EN:1;
      uint64_t WAKEUP1_EN:1;
      uint64_t WAKEUP2_EN:1;
      uint64_t WAKEUP3_EN:1;
      uint64_t ATIMER_EN:1;
      uint64_t RTC_EN:1;
      uint64_t BOD_EN:1;
      uint64_t WWDT_EN:1;
      uint64_t ETH_EN:1;
      uint64_t USB0_EN:1;
      uint64_t USB1_EN:1;
      uint64_t SDMMC_EN:1;
      uint64_t CAN_EN:1;
      uint64_t TIM2_EN:1;
      uint64_t TIM6_EN:1;
      uint64_t QEI_EN:1;
      uint64_t TIM14_EN:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_EN:1;
      uint64_t BODRESET_EN:1;
      uint64_t DPDRESET_EN:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_CLRST:1;
      uint64_t WAKEUP1_CLRST:1;
      uint64_t WAKEUP2_CLRST:1;
      uint64_t WAKEUP3_CLRST:1;
      uint64_t ATIMER_CLRST:1;
      uint64_t RTC_CLRST:1;
      uint64_t BOD_CLRST:1;
      uint64_t WWDT_CLRST:1;
      uint64_t ETH_CLRST:1;
      uint64_t USB0_CLRST:1;
      uint64_t USB1_CLRST:1;
      uint64_t SDMMC_CLRST:1;
      uint64_t CAN_CLRST:1;
      uint64_t TIM2_CLRST:1;
      uint64_t TIM6_CLRST:1;
      uint64_t QEI_CLRST:1;
      uint64_t TIM14_CLRST:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_CLRST:1;
      uint64_t BODRESET_CLRST:1;
      uint64_t DPDRESET_CLRST:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP0_SETST:1;
      uint64_t WAKEUP1_SETST:1;
      uint64_t WAKEUP2_SETST:1;
      uint64_t WAKEUP3_SETST:1;
      uint64_t ATIMER_SETST:1;
      uint64_t RTC_SETST:1;
      uint64_t BOD_SETST:1;
      uint64_t WWDT_SETST:1;
      uint64_t ETH_SETST:1;
      uint64_t USB0_SETST:1;
      uint64_t USB1_SETST:1;
      uint64_t SDMMC_SETST:1;
      uint64_t CAN_SETST:1;
      uint64_t TIM2_SETST:1;
      uint64_t TIM6_SETST:1;
      uint64_t QEI_SETST:1;
      uint64_t TIM14_SETST:1;
      uint64_t RESERVED_0:2;
      uint64_t RESET_SETST:1;
      uint64_t BODRESET_SETST:1;
      uint64_t DPDRESET_SETST:1;
      uint64_t RESERVED_1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_STAT;

