iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_PHY_RX_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_PHY_TX_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_APB1_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_APB3_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_LCD_CLK;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_SDIO_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_SSP0_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_SSP1_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_UART0_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_UART1_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_UART2_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_UART3_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_OUT_CLK;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_AUDIO_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_CGU_OUT0_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED_0:10;
      uint64_t AUTOBLOCK:1;
      uint64_t RESERVED_1:12;
      uint64_t CLK_SEL:5;
      uint64_t RESERVED_2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_CGU_OUT1_CLK;

};

#define CGU (*(volatile struct CGU_tag *) 0x40050014)

struct CCU1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASE_APB3_CLK_IND:1;
      uint64_t BASE_APB1_CLK_IND:1;
      uint64_t BASE_SPIFI_CLK_IND:1;
      uint64_t BASE_M3_CLK_IND:1;
      uint64_t RESERVED_0:3;
      uint64_t BASE_USB0_CLK_IND:1;
      uint64_t BASE_USB1_CLK_IND:1;
      uint64_t RESERVED_1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_STAT;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_BUS_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_BUS_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_I2C1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_I2C1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_DAC_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_DAC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_ADC0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_ADC0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_ADC1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_ADC1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_CAN0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB3_CAN0_STAT;

  uint8_t res1[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_BUS_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_BUS_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_MOTOCONPWM_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_MOTOCONPWM_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_I2C0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_I2C0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_I2S_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_I2S_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_CAN1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB1_CAN1_STAT;

  uint8_t res2[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SPIFI_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SPIFI_STAT;

  uint8_t res3[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_BUS_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_BUS_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SPIFI_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SPIFI_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_GPIO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_GPIO_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_LCD_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_LCD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_ETHERNET_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_ETHERNET_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USB0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USB0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_EMC_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_EMC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SDIO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SDIO_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_DMA_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_DMA_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_M3CORE_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_M3CORE_STAT;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SCT_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_SCT_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USB1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_USB1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_EMCDIV_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_EMCDIV_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_FLASHA_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_FLASHA_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_FLASHB_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_M3_FLASHB_STAT;

