iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
};

#define CCU1 (*(volatile struct CCU1_tag *) 0x40051000)

struct CCU2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t BASE_UART3_CLK:1;
      uint64_t BASE_UART2_CLK:1;
      uint64_t BASE_UART1_CLK:1;
      uint64_t BASE_UART0_CLK:1;
      uint64_t BASE_SSP1_CLK:1;
      uint64_t BASE_SSP0_CLK:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE_STAT;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_AUDIO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_AUDIO_STAT;

  uint8_t res1[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB2_USART3_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB2_USART3_STAT;

  uint8_t res2[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB2_USART2_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB2_USART2_STAT;

  uint8_t res3[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB0_UART1_BUS_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB0_UART1_STAT;

  uint8_t res4[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB0_USART0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB0_USART0_STAT;

  uint8_t res5[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB2_SSP1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB2_SSP1_STAT;

  uint8_t res6[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB0_SSP0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_APB0_SSP0_STAT;

  uint8_t res7[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SDIO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t AUTO:1;
      uint64_t WAKEUP:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SDIO_STAT;

};

#define CCU2 (*(volatile struct CCU2_tag *) 0x40052000)

struct RGU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORE_RST:1;
      uint64_t PERIPH_RST:1;
      uint64_t MASTER_RST:1;
      uint64_t RESERVED_0:1;
      uint64_t WWDT_RST:1;
      uint64_t CREG_RST:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t BUS_RST:1;
      uint64_t SCU_RST:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t M0_SUB_RST:1;
      uint64_t M3_RST:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t LCD_RST:1;
      uint64_t USB0_RST:1;
      uint64_t USB1_RST:1;
      uint64_t DMA_RST:1;
      uint64_t SDIO_RST:1;
      uint64_t EMC_RST:1;
      uint64_t ETHERNET_RST:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t FLASHA_RST:1;
      uint64_t RESERVED_9:1;
      uint64_t EEPROM_RST:1;
      uint64_t GPIO_RST:1;
      uint64_t FLASHB_RST:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0_RST:1;
      uint64_t TIMER1_RST:1;
      uint64_t TIMER2_RST:1;
      uint64_t TIMER3_RST:1;
      uint64_t RITIMER_RST:1;
      uint64_t SCT_RST:1;
      uint64_t MOTOCONPWM_RST:1;
      uint64_t QEI_RST:1;
      uint64_t ADC0_RST:1;
      uint64_t ADC1_RST:1;
      uint64_t DAC_RST:1;
      uint64_t RESERVED_0:1;
      uint64_t UART0_RST:1;
      uint64_t UART1_RST:1;
      uint64_t UART2_RST:1;
      uint64_t UART3_RST:1;
      uint64_t I2C0_RST:1;
      uint64_t I2C1_RST:1;
      uint64_t SSP0_RST:1;
      uint64_t SSP1_RST:1;
      uint64_t I2S_RST:1;
      uint64_t SPIFI_RST:1;
      uint64_t CAN1_RST:1;
      uint64_t CAN0_RST:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:3;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_CTRL1;

