iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  uint8_t res7[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP8_8;

  uint8_t res8[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t RESERVED_0:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSP9_6;

  uint8_t res9[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPA_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPA_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t RESERVED_0:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t EHD:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPA_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPA_4;

  uint8_t res10[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPB_6;

  uint8_t res11[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPC_14;

  uint8_t res12[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPD_16;

  uint8_t res13[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPE_15;

  uint8_t res14[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t EPD:1;
      uint64_t EPUN:1;
      uint64_t EHS:1;
      uint64_t EZI:1;
      uint64_t ZIF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSPF_6;

