iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
};

#define MCPWM (*(volatile struct MCPWM_tag *) 0x400a0000)

struct I2C0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t AA:1;
      uint64_t SI:1;
      uint64_t STO:1;
      uint64_t STA:1;
      uint64_t I2EN:1;
      uint64_t RESERVED_1:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t Status:5;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t AAC:1;
      uint64_t SIC:1;
      uint64_t RESERVED_1:1;
      uint64_t STAC:1;
      uint64_t I2ENC:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MM_ENA:1;
      uint64_t ENA_SCL:1;
      uint64_t MATCH_ALL:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_BUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK3;

};

#define I2C0 (*(volatile struct I2C0_tag *) 0x400a1000)

struct I2C1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t AA:1;
      uint64_t SI:1;
      uint64_t STO:1;
      uint64_t STA:1;
      uint64_t I2EN:1;
      uint64_t RESERVED_1:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t Status:5;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t AAC:1;
      uint64_t SIC:1;
      uint64_t RESERVED_1:1;
      uint64_t STAC:1;
      uint64_t I2ENC:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MM_ENA:1;
      uint64_t ENA_SCL:1;
      uint64_t MATCH_ALL:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_BUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK3;

