iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
};

#define I2C1 (*(volatile struct I2C1_tag *) 0x400e0000)

struct I2S0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORDWIDTH:2;
      uint64_t MONO:1;
      uint64_t STOP:1;
      uint64_t RESET:1;
      uint64_t WS_SEL:1;
      uint64_t WS_HALFPERIOD:9;
      uint64_t MUTE:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORDWIDTH:2;
      uint64_t MONO:1;
      uint64_t STOP:1;
      uint64_t RESET:1;
      uint64_t WS_SEL:1;
      uint64_t WS_HALFPERIOD:9;
      uint64_t RESERVED:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2STXFIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SRXFIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:1;
      uint64_t DMAREQ1:1;
      uint64_t DMAREQ2:1;
      uint64_t RESERVED_0:5;
      uint64_t RX_LEVEL:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_LEVEL:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_DMA1_ENABLE:1;
      uint64_t TX_DMA1_ENABLE:1;
      uint64_t RESERVED_0:6;
      uint64_t RX_DEPTH_DMA1:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_DEPTH_DMA1:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_DMA2_ENABLE:1;
      uint64_t TX_DMA2_ENABLE:1;
      uint64_t RESERVED_0:6;
      uint64_t RX_DEPTH_DMA2:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_DEPTH_DMA2:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_IRQ_ENABLE:1;
      uint64_t TX_IRQ_ENABLE:1;
      uint64_t RESERVED_0:6;
      uint64_t RX_DEPTH_IRQ:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_DEPTH_IRQ:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Y_DIVIDER:8;
      uint64_t X_DIVIDER:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Y_DIVIDER:8;
      uint64_t X_DIVIDER:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_BITRATE:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBITRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BITRATE:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBITRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCLKSEL:2;
      uint64_t TX4PIN:1;
      uint64_t TXMCENA:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCLKSEL:2;
      uint64_t RX4PIN:1;
      uint64_t RXMCENA:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMODE;

};

#define I2S0 (*(volatile struct I2S0_tag *) 0x400a2000)

struct I2S1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORDWIDTH:2;
      uint64_t MONO:1;
      uint64_t STOP:1;
      uint64_t RESET:1;
      uint64_t WS_SEL:1;
      uint64_t WS_HALFPERIOD:9;
      uint64_t MUTE:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORDWIDTH:2;
      uint64_t MONO:1;
      uint64_t STOP:1;
      uint64_t RESET:1;
      uint64_t WS_SEL:1;
      uint64_t WS_HALFPERIOD:9;
      uint64_t RESERVED:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2STXFIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SRXFIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:1;
      uint64_t DMAREQ1:1;
      uint64_t DMAREQ2:1;
      uint64_t RESERVED_0:5;
      uint64_t RX_LEVEL:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_LEVEL:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_DMA1_ENABLE:1;
      uint64_t TX_DMA1_ENABLE:1;
      uint64_t RESERVED_0:6;
      uint64_t RX_DEPTH_DMA1:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_DEPTH_DMA1:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_DMA2_ENABLE:1;
      uint64_t TX_DMA2_ENABLE:1;
      uint64_t RESERVED_0:6;
      uint64_t RX_DEPTH_DMA2:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_DEPTH_DMA2:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_IRQ_ENABLE:1;
      uint64_t TX_IRQ_ENABLE:1;
      uint64_t RESERVED_0:6;
      uint64_t RX_DEPTH_IRQ:4;
      uint64_t RESERVED_1:4;
      uint64_t TX_DEPTH_IRQ:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Y_DIVIDER:8;
      uint64_t X_DIVIDER:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Y_DIVIDER:8;
      uint64_t X_DIVIDER:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_BITRATE:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBITRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BITRATE:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBITRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCLKSEL:2;
      uint64_t TX4PIN:1;
      uint64_t TXMCENA:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCLKSEL:2;
      uint64_t RX4PIN:1;
      uint64_t RXMCENA:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMODE;

