iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVENTROUTER_13_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVENTROUTER_14_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVENTROUTER_16_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCSTART0_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t EDGE:1;
      uint64_t SYNCH:1;
      uint64_t PULSE:1;
      uint64_t SELECT:4;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCSTART1_IN;

};

#define GIMA (*(volatile struct GIMA_tag *) 0x400c7000)

struct DAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t VALUE:10;
      uint64_t BIAS:1;
      uint64_t RESERVED_1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_DMA_REQ:1;
      uint64_t DBLBUF_ENA:1;
      uint64_t CNT_ENA:1;
      uint64_t DMA_ENA:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTVAL;

};

#define DAC (*(volatile struct DAC_tag *) 0x400e1000)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:8;
      uint64_t CLKDIV:8;
      uint64_t BURST:1;
      uint64_t CLKS:3;
      uint64_t RESERVED_0:1;
      uint64_t PDN:1;
      uint64_t RESERVED_1:2;
      uint64_t START:3;
      uint64_t EDGE:1;
      uint64_t RESERVED_2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:8;
      uint64_t CHN:3;
      uint64_t RESERVED_2:3;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GDR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADINTEN:8;
      uint64_t ADGINTEN:1;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:8;
      uint64_t OVERUN:8;
      uint64_t ADINT:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define ADC0 (*(volatile struct ADC0_tag *) 0x400e3000)

struct ADC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:8;
      uint64_t CLKDIV:8;
      uint64_t BURST:1;
      uint64_t CLKS:3;
      uint64_t RESERVED_0:1;
      uint64_t PDN:1;
      uint64_t RESERVED_1:2;
      uint64_t START:3;
      uint64_t EDGE:1;
      uint64_t RESERVED_2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:8;
      uint64_t CHN:3;
      uint64_t RESERVED_2:3;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GDR;

