iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC18xx/emptyTargetInit/LPC1857_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR7;

  uint8_t res7[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT7;

};

#define GPIO_PORT (*(volatile struct GPIO_PORT_tag *) 0x400f4000)

